<?php
$lang['请选择实验室!'] = '请选择课题组!';
$lang['您选择了一个不存在的实验室！'] = '您选择了一个不存在的课题组！';
$lang['您已经成功注册用户。请打印下表，经实验室管理员签字后，提交到网络中心。'] = '您已经成功注册用户。请打印下表，经课题组管理员签字后，提交到网络中心。';
$lang['您的登录密码更新失败! 请与实验室负责人联系.'] = '您的登录密码更新失败! 请与课题组负责人联系.';
$lang['实验室房间号'] = '课题组房间号';
$lang['实验室'] = '课题组';
$lang['实验室提醒'] = '课题组提醒';
$lang['实验室人员被激活时不接收提醒'] = '课题组人员被激活时不接收提醒';
$lang['您实验室中%user的账号已被激活了'] = '您课题组中%user的账号已被激活了';
$lang['您好%PI：\n您的实验室%lab中,%user的账号已经被激活了。'] = '您好%PI：\n您的课题组%lab中,%user的账号已经被激活了。';
$lang['实验室PI'] = '课题组PI';
$lang['实验室可见'] = '课题组可见';
$lang['实验室名称'] = '课题组名称';
$lang['实验室联系方式'] = '课题组联系方式';
$lang['操作超时, 请刷新页面后重试!'] = NULL;
