<?php
$lang['[大数据体系]查看负责仪器的预约情况'] = '查看负责仪器的预约情况';
$lang['[大数据体系]查看负责仪器的送样情况'] = '查看负责仪器的送样情况';
$lang['[大数据体系]查看负责仪器的使用记录'] = '查看负责仪器的使用记录';
$lang['[大数据体系]查看负责仪器的使用收费情况'] = '查看负责仪器的使用收费情况';
$lang['[大数据体系]查看负责仪器的故障情况'] = '查看负责仪器的故障情况';

$lang['[大数据体系]查看所有仪器的预约情况'] = '查看所有仪器的预约情况';
$lang['[大数据体系]查看所有仪器的送样情况'] = '查看所有仪器的送样情况';
$lang['[大数据体系]查看所有仪器的使用记录'] = '查看所有仪器的使用记录';
$lang['[大数据体系]查看所有仪器的使用收费情况'] = '查看所有仪器的使用收费情况';
$lang['[大数据体系]查看所有仪器的故障情况'] = '查看所有仪器的故障情况';
$lang['[大数据体系]负责仪器的科技部对接管理'] = '负责仪器的科技部对接管理';
$lang['[大数据体系]管理负责仪器科技厅上报信息'] = '管理负责仪器科技厅上报信息';
$lang['[大数据体系]查看负责仪器的仪器信息'] = '查看负责仪器的仪器信息';
$lang['[大数据体系]查看负责仪器的使用汇总'] = '查看负责仪器的使用汇总';
$lang['[大数据体系]查看负责仪器的效益统计'] = '查看负责仪器的效益统计';
$lang['[大数据体系]查看负责课题组的效益统计'] = '查看负责课题组的效益统计';
$lang['[大数据体系]查看负责仪器的统计图表'] = '查看负责仪器的统计图表';
$lang['[大数据体系]查看负责课题组的统计图表'] = '查看负责课题组的统计图表';
$lang['[大数据体系]查看自己的服务绩效'] = '查看自己的服务绩效';
$lang['[大数据体系]查看负责课题组使用效益'] = '查看负责课题组使用效益';

$lang['[大数据体系]管理申报任务'] = '管理申报任务';
$lang['[大数据体系]填报仪器数据'] = '填报仪器数据';
$lang['[大数据体系]审核仪器数据'] = '审核仪器数据';
$lang['[大数据体系]辅助机主填报仪器数据'] = '辅助机主填报仪器数据';

$lang['[大数据体系]查看下属机构仪器的预约情况'] = '查看下属机构仪器的预约情况';
$lang['[大数据体系]查看下属机构仪器的送样情况'] = '查看下属机构仪器的送样情况';
$lang['[大数据体系]查看下属机构仪器的使用记录'] = '查看下属机构仪器的使用记录';
$lang['[大数据体系]查看下属机构仪器的使用收费情况'] = '查看下属机构仪器的使用收费情况';
$lang['[大数据体系]查看下属机构仪器的故障情况'] = '查看下属机构仪器的故障情况';

$lang['[大数据体系]查看下属机构成员的信用情况'] = '查看下属机构成员的信用情况';
$lang['[大数据体系]查看所有成员的信用情况'] = '查看所有成员的信用情况';