#!/usr/bin/env php
<?php

require "base.php";

class User_Incubator {
	static $mail_domains = [
		'fudan.edu.cn', 'nankai.edu.cn', 'geneegroup.com', 'tju.edu.cn', 'tsinghua.edu.cn', 'harvard.edu', 'stanford.edu'
	];

	static $last_names = [
		'赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈','韩','杨','朱','秦','尤','许','何','吕','施','张','孔','曹','严','华','金','魏','陶','姜','戚','谢','邹','喻','柏','水','窦','章','云','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤','花','方'
	];

	static $first_names = [
		'春华', '昊坤', '欢', '浴', '晗恺', '运凤', '冰雁', '玫', '昱名', '飞海', '漫漩', '阿云', '柳宏', '思蓓', '舒', '婉晴', '鹏', '沂', '语凡', '孝成', '耀抿', '秋廷', '若彤', '欢欢', '锟', '清', '保林', '可涵', '翊竣', '岑羽', '婕', '晨', '麟华', '灵丹', '巧峰', '镘镘', '晗煊', '雪域', '砺元', '立优', '韦平', '洁希', '素稳', '建', '亮柱', '玉茜', '梦铃', '钦瑜', '铭崴', '绾绾', '曦涵', '昊澄', '昀哲', '艳雯', '曼', '亚平', '志鉴', '钬', '婉若', '宵嵩', '海心', '毓华', '铸', '果', '彦瑾', '玉凤', '旭旭', '华明', '宏智', '赢春', '丽侠', '潞', '煊铄', '俊秀', '春芹', '荣齐', '智元', '月齐', '梦苑', '长兰', '欣懿', '世蛉', '纤', '文琪', '富隆', '诗梦', '昕晨', '氤漪', '滴佳', '丽珍', '宝成', '阿千', '个', '佳灵', '若祺', '华军', '玉麟', '蛙蛙', '子轩', '艺心', '枝芹', '乃一', '灿', '羿君', '致轩', '子淇', '希蕾', '威立', '咪', '平福', '绮丹', '曙波', '则好', '拉其', '秀钤', '晓清', '雪松', '天臣', '宋珈', '惠达', '云', '伟峰', '富财', '译诺', '永栓', '杨孜', '天跑', '卓凡', '航辰', '思澧', '龙飞', '冰冰', '廷钢', '诗翌', '海娴', '金莲', '立夫', '煜煮', '稳', '明曦', '文德', '云', '馨轶', '少桦', '俊桦', '鸣晨', '展旭', '杰守', '云耀', '卓翰', '露彦', '光曜', '一哲', '小希', '美荣', '大', '禹九', '翰林', '保仲', '然华', '庆淼', '子鸣', '志通', '明珠', '建勤', '鸿', '易灵', '睿涵', '杰洋', '晏池', '尝君', '昱行', '张慧', '铭郝', '薏砹', '于国', '尖', '宏杰', '俊友', '炫威', '晓强', '博雅', '佳宜', '小桓', '克寒', '瑜黛', '佳诺', '瑞烨', '文超', '粟函', '其龙', '樱凡', '小丰', '军辉', '佳宜', '淼炜', '镇恶', '宏远', '冰', '敏达', '元寿', '伟荣', '海旭', '天鹤', '洁佳', '昔奋', '蚌蚌', '沐豪', '奉先', '丽波', '键军', '久力', '纯', '金福', '今政', '锦皓', '宸曦', '纾因', '海伯', '晗煜', '日财', '凯宇', '振宣', '凯杰', '佰晟', '再兴', '尉蓬', '庭祯', '艺渲', '旖晰', '金钰', '新之', '增泓', '谦', '安庆', '浩林', '璁', '东生', '侯镊', '绍筠', '朋', '经国', '泽通', '玉香', '文婕', '唐薇', '白如', '恺欣', '锐', '锌熠', '海飞', '明俊', '宗魁', '飞飞', '裕琪', '晟阳', '澜莎', '文烃', '荣辉', '昊宸', '晓坡', '嘉合', '佳宁', '皓诚', '智博', '富珏', '海俊', '双', '瑞得', '思楠', '凯淇', '业', '鹏飞', '凌羽', '健康', '心海', '传帅', '瑞泽', '逸群', '校国', '校言', '育衡', '乙甄', '雯海', '宏琛', '煜', '洼江', '禹飞', '思青', '清平', '六国', '怀宝', '展旭', '卫星', '煜杰', '彦霖', '冗', '昕蓓', '雨爽', '瑜奕', '书涵', '殊晴', '名', '光宇', '昶粼', '桢沁', '雪道', '祚泰', '肖栋', '羽茜', '易晗', '砚', '少卅', '秋雨', '鸿鸣', '平凡', '恣岚', '恒昌', '煜嵩', '克良', '潇闻', '涵微', '艾', '炳睿', '运琪', '锦洋', '沁海', '瑞峰', '亦昀', '梅鸾', '兴涣', '秀林', '锦蕊', '道林', '裕茏', '非扬', '少波', '宇菲', '夕涵', '希尔', '绍洪', '鹤翔', '月明', '潇羽', '新童', '历森', '敬松', '骞寻', '栋', '尽力', '世谊', '冰静', '诗扬', '烨', '家惠', '应辉', '浩然', '冰佑', '梦艺', '国宏', '长石', '治平', '泺', '啉', '言乐', '帅', '辰露', '荣薇', '国强', '揿蔚', '小涵', '忻', '梦楷', '嘉扬', '舸蔓', '玉村', '龙', '霁蕾', '舒畅', '庆录', '与岚', '正国', '书锴', '丽月', '严国', '子鸿', '梦笛', '缨枝', '劲光', '建华', '爱虹', '镰信', '以轩', '永根', '千蕙', '伶冰', '婕涵', '孟珍', '晔', '冰渠'
	];

	static function generate() {
		$last_i = rand(0, count(self::$last_names)-1);
		$first_i = rand(0, count(self::$first_names)-1);
		$last_name = self::$last_names[$last_i];
		$first_name = self::$first_names[$first_i];
		$name = $last_name.$first_name;
		$mail_i = rand(0, count(self::$mail_domains)-1);
		$token = str_replace(' ', '', PinYin::code($first_name)).'.'.PinYin::code($last_name);
		$mail = $token .'@'.self::$mail_domains[$mail_i];

		self::add_user($name, $token, $mail);
	}

	static function add_user($name, $token, $mail) {
		$user = O('user');

		$user->token = $token;
		
		$user->email = $mail;
		
		$user->name = $name;

		$user->member_type = 0;
		$user->atime = time();
		
		$user->save();

		echo "$name<$mail> added.\n";
	}

}


$max = (int)$argv[1];
for($i=0; $i<$max; $i++) {
	User_Incubator::generate();
}
