<?php

$config['manucountrycode'] = [
	'亚洲' => [
	'A004' => '&#160;&#160;中国',
	'A356' => '&#160;&#160;印度',
	'A392' => '&#160;&#160;日本',
	'A704' => '&#160;&#160;越南',
	'A702' => '&#160;&#160;新加坡'],
	'非洲' => [
	'B140' => '&#160;&#160;中非',
	'B710' => '&#160;&#160;南非'],
	'欧洲' => [
	'C040' => '&#160;&#160;奥地利',
	'C208' => '&#160;&#160;丹麦',
	'C246' => '&#160;&#160;芬兰',
	'C250' => '&#160;&#160;法国',
	'C276' => '&#160;&#160;德国',
	'C380' => '&#160;&#160;意大利',
	'C528' => '&#160;&#160;荷兰',
	'C643' => '&#160;&#160;俄罗斯联邦',
	'C752' => '&#160;&#160;瑞典',
	'C756' => '&#160;&#160;瑞士',
	'C826' => '&#160;&#160;英国'],
	'美洲' =>  [
	'D076' => '&#160;&#160;巴西',
	'D124' => '&#160;&#160;加拿大',
	'D484' => '&#160;&#160;墨西哥',
	'D840' => '&#160;&#160;美国'],
	'大洋洲' => [
	'E036' => '&#160;&#160;澳大利亚',
	'E554' => '&#160;&#160;新西兰'],
	'南极洲' => []
];

$config['ShareLevel'] = [
	1 => '高水平人才培养',
	2 => '高水平科研',
	3 => '支持西部发展',
	4 => '国际合作',
	5 => '支持企业创新',
	6 => '公共安全服务'
];

$config['enable_share'] = TRUE;

$config['share_fields'] = [
	'LSNUSEDHRS' => '使用机时（教学）',
	'RSCHUSEDHRS' => '使用机时（科研）',
	'SERUSEDHRS' => '使用机时（社会服务）',
	'OPENHRS' => '使用机时（其中开放使用机时）',
	'SAMPLENUM' => '测样数',
	'TRNSTUD' => '培训人员数（学生）',
	'TRNTEACH' => '培训人员数（教师）',
	'TRNOTHERS' => '培训人员数（其他）',
	'EDUPROJ' => '教学实验项目数',
	'RSCHPROJ' => '科研项目数',
	'SOCIALPROJ' => '社会服务项目数',
	'RWDNATION' => '获奖情况（国家级）',
	'RWDPROV' => '获奖情况（省部级',
	'RWDTEACH' => '发明专利（教师）',
	'RWDSTUD' => '发明专利（学生）',
	'PAPERINDEX' => '论文情况（三大检索）',
	'PAPERKERNEL' => '论文情况（核心刊物）',
	'CHARGEMAN' => '负责人姓名'
];
