<?php
$lang['恢复'] = 'Reset';
$lang['最小阈值填写有误, 请填写大于等于0的数值!'] = '';
$lang['最大阈值填写有误, 请填写大于等于0的数值!'] = '';
$lang['最大值和最小值不能相等!'] = '';
$lang['率在此阈值范围时, 为仪器的有效机时'] = '';
$lang['最小阈值为X, 最大阈值为空, 表示阈值范围为 "大于X W"'] = '';
$lang['最大阈值为X, 最小阈值为空, 表示阈值范围为 "小于X W"'] = '';
$lang['设置'] = 'Setting';
$lang['功率阈值范围: %min - %max W'] = '';
$lang['功率阈值范围: 大于%watt W'] = '';
$lang['功率阈值范围: 小于%watt W'] = '';
$lang['曲线坐标'] = 'Axis';
$lang['不显示'] = '';
$lang['功率'] = 'Wattage';
$lang['最小阈值和最大阈值不能相等!'] = '';
$lang['最小阈值和最大阈值不能都为空!'] = '';